TestEDT/src/Enums/уа_КатегорииАктива/уа_КатегорииАктива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уа_КатегорииАктива</name>
  <enumValues>
    <name>Акция</name>
  </enumValues>
  <enumValues>
    <name>Облигация</name>
  </enumValues>
  <enumValues>
    <name>Пай</name>
  </enumValues>
  <enumValues>
    <name>ДепозитарнаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>ИпотечныйСертификатУчастия</name>
  </enumValues>
  <enumValues>
    <name>Вексель</name>
  </enumValues>
  <enumValues>
    <name>Опцион</name>
  </enumValues>
  <enumValues>
    <name>Фьючерс</name>
  </enumValues>
  <enumValues>
    <name>СВОП</name>
  </enumValues>
</mdclass:Enum>

TestEDT/src/Enums/уа_КатегорииАктива/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция НайтиПоКоду(Идентификатор) Экспорт
	КатегорияАктива = Неопределено;
	
	Если Идентификатор = "Облигация" Тогда
		КатегорияАктива 	= Перечисления.уа_КатегорииАктива.Облигация;
	ИначеЕсли Идентификатор = "Акция" Тогда 
		КатегорияАктива 	= Перечисления.уа_КатегорииАктива.Акция;
	ИначеЕсли Идентификатор = "Ипотечный сертификат" Тогда 
		КатегорияАктива 	= Перечисления.уа_КатегорииАктива.ИпотечныйСертификатУчастия;
	ИначеЕсли Идентификатор = "Депозитарная расписка" Тогда 
		КатегорияАктива 	= Перечисления.уа_КатегорииАктива.ДепозитарнаяРасписка;
	ИначеЕсли Идентификатор = "Фонд" Тогда 
		КатегорияАктива 	= Перечисления.уа_КатегорииАктива.Пай;
	КонецЕсли;
	
	Возврат КатегорияАктива;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
